Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/health_services_for_people_with_disabilities/blind_welfare_allowance.html.txt.tmx
Source language: en
Languages: ga

source: The Blind Welfare Allowance is a means-tested payment from the Health Service Executive (HSE) to people who are blind or visually impaired
ga: Is é atá i Liúntas na Dall ná íocaíocht tástáilte ó thaobh acmhainne ó Fheidhmeannacht na Seirbhíse Sláinte (FSS) do dhaoine atá dall nó ar lagamharc

source: The allowance is paid to eligible people from 18 years of age
ga: Íoctar an liúntas le daoine incháilithe atá 18 bliana d’aois nó níos sine

source: You may qualify for Blind Welfare Allowance if you:
ga: D'fhéadfadh sé go mbeadh tú i dteadeal Liúntas Leasa na nDall má tá:

source: • Are getting Blind Pension from the Department of Social Protection
ga: • Tú ag fáil Pinsean na nDall ón Roinn Coimirce Sóisialaí

source: • Are getting an income maintenance payment from the Department of Social Protection, or an equivalent type social security payment from another country, and have a certificate of visual impairment from an ophthalmologist
ga: • Íocaíocht chothabhála ioncaim á fáil agat ón Roinn Coimirce Sóisialaí nó a chomhionann de shaghas d’íocaíocht slándála sóisialaí ó thír eile agus deimhniú um lagú amhairc a bheith agat ó oftailmeolaí

source: • Have an income below the combined Blind Pension rate and Blind Welfare Allowance rate and have a certificate of visual impairment from an ophthalmic surgeon
ga: • Ioncam a bheith agat atá faoi bhun chomhráta Phinsean na nDall agus ráta Liúntas Leasa na nDall agus deimhniú um lagú amhairc a bheith agat ó oftailmeolaí

source: To qualify for Blind Welfare Allowance, your vision must have "best vision equal to or less than 6/60 in the better eye or if the field of vision is limited, the widest diameter of vision subtending an angle of not greater than 20 degrees"
ga: Chun Liúntas Leas na nDall a fháil, ní mór duit “radharc na súl is fear a bheith cothrom le nó níos lú ná 6/60 sa tsúil is fearr nó má tá raon an radhairc teoranta, nach mbeadh an trastomhas is leithne ag gabháil uillinn níos mó ná 20 céim”

source: This can be confirmed by a certificate of visual acuity from your ophthalmic surgeon or by a letter from the National Council for the Blind of Ireland (NCBI), who can confirm whether you meet the criteria to register as blind
ga: Is féidir seo a dheimhniú ag deimhniú um ghéire amhairc ó do mháinlia oftalmach nó ag litir ó Chomhairle Náisiúnta na hÉireann do na Daill (CNÉD), ar féidir leo a dheimhniú cibé acu an gcomhlíonann nó nach gcomhlíonann tú na critéir chun clárú amhail bheith dall

source: People do not have to be meet this registration criteria in order to use the services of NCBI
ga: Ní gá do dhaoine na critéir chlárúcháin seo a chomhlíonadh chun úsáid a bhaint as seirbhísí an CNÉD

source: You cannot get Blind Welfare Allowance if you are in a long-term residential care facility
ga: Ní féidir leat Liúntas na nDall a fháil má tá tú i saoráid cúraim chónaithe fhadtéarmaigh

source: However, if you are admitted into a residential care facility you can keep your Blind Welfare Allowance for a maximum of 8 continuous weeks in any 12 month period
ga: Má ghlactar isteach i saoráid cúraim chónaithe tú, áfach, is féidir leat Liúntas na nDall a choinneáil ar feadh 8 seachtaine leanúnach ar a mhéad in aon tréimhse 12 mhí

source: The weekly rate for Blind Welfare Allowance is:
ga: Faoi láthair íoctar na rátaí seo a leanas do Liúntas Leasa na nDall:

source: • €58.50 for a single person
ga: • €58.50 sa tseachtain do dhuine singil

source: • €117.00 for a blind couple
ga: • €117.00 sa tseachtain do lánúin atá dall

source: • €4.40 for each child dependant
ga: • €4.40 sa tseachtain ar son gach páiste chleithiúnaigh

source: The Blind Welfare Allowance rate for a couple is only applicable where both the applicant and partner/spouse are blind or visually impaired and qualify for the allowance
ga: Íoctar an ráta do Liúntas Leasa na nDall do lánúin nuair atá an bheirt - an t-iarrthóir agus an páirtí/céile cáilithe lena aghaidh

source: Apply to your Local Health Office for the Blind Welfare Allowance
ga: Cuir iarratas ar Liúntas Leasa na nDall chuig d'Oifig Sláinte Áitiúil

source: If you consider that you have been wrongly refused Blind Welfare Allowance you can appeal the decision using the HSE appeals process
ga: Má shíleann tú gur diúltaíodh Liúntas Leasa na nDall duit go héagórach, tá an rogha agat achomharc a thabhairt in aghaidh an chinnidh sin
